[
    {
        "id": 1,
        "slug": "pixel-streak",
        "name": "PixelStreak",
        "year": 2025,
        "description": "Transform your daily habits into beautiful pixel art. Each completed habit reveals a piece of stunning artwork, making habit tracking fun and visually rewarding.",
        "detailedDescription": "PixelStreak combines the power of habit tracking with the satisfaction of revealing pixel art. Every time you complete a habit, you unlock pixels that gradually reveal beautiful artwork. Stay motivated by watching your streaks grow while creating stunning visual masterpieces, one habit at a time. Built with privacy-first architecture, all your personal data stays securely on your device.",
        "subDescription": [
            "Complete habits to reveal pixel art masterpieces",
            "Track daily streaks with flame indicators",
            "All personal data stored locally on your device",
            "Gamified habit tracking that keeps you motivated"
        ],
        "category": "Productivity",
        "status": "In Development",
        "logo": "/projects/pixel-streak/logo.png",
        "screenshots": [],
        "features": [
            "Unique pixel art reveal mechanic for completed habits",
            "Daily habit tracking with visual streak counters",
            "Personalized experience with custom name input",
            "Clean, modern Material Design interface",
            "Privacy-first: personal data stored locally on device",
            "Beautiful avatar and pixel art generation using DiceBear API",
            "Beautiful animations and smooth transitions",
            "Dark and light theme support",
            "Customizable habit schedules and durations",
            "Motivational flame icons for active streaks"
        ],
        "github": "",
        "playstore": "",
        "website": "",
        "privacyPolicy": {
            "lastUpdated": "2025-12-30",
            "sections": [
                {
                    "title": "Information We Collect",
                    "content": "PixelStreak collects your name for app functionality, which is stored ONLY on your device and used exclusively to personalize your experience within the app. Additionally, the app stores: habits you create (name, schedule, duration), completion history and streaks, pixel art progress, and app settings/preferences. All data is stored locally using Android's secure storage (SharedPreferences and SQLite database) and remains completely private to you. Your name and personal data are never transmitted to our servers or any third parties."
                },
                {
                    "title": "How We Use Your Information",
                    "content": "Your name is collected and stored locally to personalize your app experience by displaying it within the app interface. Your other locally stored information is used to: track your habit completion and streaks, reveal pixel art based on your progress, and save your app preferences and settings. All your personal data remains on your device. We have no access to your information and it is never transmitted anywhere."
                },
                {
                    "title": "Third-Party Services",
                    "content": "PixelStreak uses DiceBear Avatars API (https://dicebear.com) to generate avatar and pixel art images displayed in the app. Important: No personal user data is sent to DiceBear. The app sends only generic seed values (random strings or identifiers) to DiceBear's API to generate unique images. These seed values do not contain your name, habits, or any personal information. DiceBear simply generates images based on these seed values and does not store any data. For more information, please review DiceBear's privacy policy at https://dicebear.com. Apart from DiceBear for image generation, PixelStreak does NOT use: analytics services (e.g., Google Analytics, Firebase Analytics), crash reporting tools (e.g., Crashlytics), advertising networks, social media integrations, or cloud storage/backup services."
                },
                {
                    "title": "Internet Connection",
                    "content": "PixelStreak requires an internet connection only to load images from DiceBear API for: generating avatar images and pixel art images used in the reveal feature. Once images are loaded and cached, they can be viewed offline. All core app functionality works without internet, including: habit tracking, streak counting, marking habits as complete, and tracking your pixel reveal progress. Your personal data (name, habits, progress) is never transmitted over the internet under any circumstances."
                },
                {
                    "title": "Data We Do NOT Transmit",
                    "content": "We do NOT transmit, upload, or sync any of your personal data to our servers or third parties. This includes: Your name, your habit names or details, your completion history or streaks, your pixel art progress, your app settings or preferences, or any other personal information. The only internet requests made by the app are to DiceBear API to load images using generic seed values that do not contain any of your personal data."
                },
                {
                    "title": "No User Accounts Required",
                    "content": "PixelStreak does not require any user accounts, login credentials, email addresses, or registration. You simply enter your name locally in the app for personalization - it is stored only on your device and never transmitted. No authentication or account creation occurs."
                },
                {
                    "title": "Data Security",
                    "content": "All your personal data (name, habits, streaks, progress) is stored locally on your device using Android's secure storage mechanisms (SharedPreferences and SQLite database). Your data never leaves your device. The app communicates with DiceBear API via HTTPS only to load images using generic seed values that do not contain your personal information. We implement secure coding practices to protect your local data from unauthorized access."
                },
                {
                    "title": "Data Export and Deletion",
                    "content": "You have full control over your data: Export - You can export your habits data as a JSON backup file from the app's settings at any time. This file remains under your control and can be saved wherever you choose. Deletion - You can delete all your app data at any time through the app's settings, or by clearing app data in your device settings, or by uninstalling the app from your device. Images loaded from DiceBear may be cached temporarily and can be cleared through app cache settings."
                },
                {
                    "title": "Children's Privacy",
                    "content": "PixelStreak collects only a name for app functionality, which is stored locally on the device and never transmitted to any server. The app uses DiceBear API to load images but does not send any personal information to DiceBear. We do not knowingly collect or transmit any personal information from children under 13. Parents should supervise their children's use of the app."
                },
                {
                    "title": "Permissions",
                    "content": "PixelStreak may request the following device permissions: Internet - required to load avatar and pixel art images from DiceBear API; Storage (if applicable) - only to save/load backup files you choose to export/import locally on your device; Notifications (if applicable) - only to send local device reminders for your habits (these are generated locally on your device and not sent through any server)."
                },
                {
                    "title": "Your Rights and Control",
                    "content": "Since we don't collect or transmit your data to any servers, there's no data for us to access, modify, or delete remotely. You have complete control over your data on your device at all times. You can view all your data within the app, export it as a backup file, modify it by editing habits and settings, or delete it entirely through app settings or by uninstalling the app."
                },
                {
                    "title": "Changes to This Policy",
                    "content": "We may update this privacy policy from time to time to reflect changes in the app, features, or legal requirements. Any changes will be reflected on this page with an updated 'Last Updated' date. We encourage you to review this policy periodically. You can check this policy online at our website or GitHub repository at any time."
                }
            ]
        }
    }
]