[
    {
        "id": 1,
        "slug": "pixel-streak",
        "name": "PixelStreak",
        "year": 2025,
        "description": "Transform your daily habits into beautiful pixel art. Each completed habit reveals a piece of stunning artwork, making habit tracking fun and visually rewarding.",
        "detailedDescription": "PixelStreak combines the power of habit tracking with the satisfaction of revealing pixel art. Every time you complete a habit, you unlock pixels that gradually reveal beautiful artwork. Stay motivated by watching your streaks grow while creating stunning visual masterpieces, one habit at a time. PixelStreak is designed with a strict no-data-collection approach: no personal data is collected, stored on external servers, or shared with third parties.",
        "subDescription": [
            "Complete habits to reveal pixel art masterpieces",
            "Track daily streaks with flame indicators",
            "No personal data collection or accounts",
            "Gamified habit tracking that keeps you motivated"
        ],
        "category": "Productivity",
        "status": "In Development",
        "logo": "/projects/pixel-streak/logo.png",
        "screenshots": [],
        "features": [
            "Unique pixel art reveal mechanic for completed habits",
            "Daily habit tracking with visual streak counters",
            "No sign-up or account required",
            "No personal data collection",
            "Clean, modern Material Design interface",
            "Beautiful pixel art generation using DiceBear API",
            "Smooth animations and delightful micro-interactions",
            "Dark and light theme support",
            "Customizable habit schedules and durations",
            "Motivational flame icons for active streaks"
        ],
        "github": "",
        "playstore": "",
        "website": "",
        "privacyPolicy": {
            "lastUpdated": "2025-12-31",
            "sections": [
                {
                    "title": "No Personal Data Collection",
                    "content": "PixelStreak does not collect, store, or process any personal data. The app does not require you to provide your name, email address, or any other personally identifiable information. No user accounts or sign-ins are required, and no personal data is transmitted to servers or third parties."
                },
                {
                    "title": "Local App Data",
                    "content": "PixelStreak may store non-personal app data locally on your device, such as your habits, completion status, streaks, and app preferences. This data is used solely to provide core app functionality and remains on your device. It is not synced, uploaded, or shared with any external servers."
                },
                {
                    "title": "Third-Party Services (DiceBear API for Pixel Art)",
                    "content": "PixelStreak uses the DiceBear API (https://dicebear.com) to generate pixel art images that are revealed as you complete your habits. The app sends only non-personal, generic seed values (random strings or identifiers) to DiceBear to request unique pixel art images. No personal data, user identifiers, or habit information is sent to DiceBear. DiceBear receives only these generic seeds to generate images and does not receive or store any user-specific personal information [web:166][web:168]."
                },
                {
                    "title": "Internet Usage",
                    "content": "An internet connection is required only to load pixel art images from the DiceBear API for the reveal feature. This involves sending non-personal seed values to generate images. All habit-related data, streaks, and preferences remain stored locally on your device and are never transmitted over the internet [web:165][web:169]."
                },
                {
                    "title": "Data We Do Not Collect",
                    "content": "PixelStreak does not collect or store: names, email addresses, usernames, passwords, contact information, precise location data, habit descriptions on any server, analytics events, advertising identifiers, device identifiers, or any other personally identifiable information. No tracking, profiling, or analytics are performed [web:170]."
                },
                {
                    "title": "Data Control and Deletion",
                    "content": "All app-related data (such as habits and streaks) is stored locally on your device. You can delete this data at any time by clearing the app data in your device settings or by uninstalling the app. Because no data is stored on external servers, there is nothing for us to access, modify, or delete on your behalf."
                },
                {
                    "title": "Children's Privacy",
                    "content": "PixelStreak is designed so that it does not collect any personal data from any user, including children. Since no personal information is collected, stored, or transmitted, the app can be used without providing identifying details. Parents or guardians should still supervise app usage as part of general device use [web:168]."
                },
                {
                    "title": "Permissions",
                    "content": "PixelStreak may request the following device permissions: Internet – used only to fetch pixel art images from the DiceBear API using non-personal seed values for the reveal feature; Notifications (if implemented) – used only to show local reminders on your device. No permission is used to collect or transmit personal data [web:166]."
                },
                {
                    "title": "Changes to This Policy",
                    "content": "We may update this privacy policy from time to time to reflect changes in the app or legal requirements. Any updates will be indicated by an updated 'Last Updated' date. If the data practices change to include any form of personal data collection, this policy will be updated before such changes take effect."
                },
                {
                    "title": "Contact Us",
                    "content": "If you have any questions about this Privacy Policy or PixelStreak, you can contact the developer at: Developer: CoreBytes01, Email: corebytes01+support@gmail.com, App: PixelStreak – Habit Tracker."
                }
            ]
        }
    }
]